# python data analysis (pandas)

To access Pandas library, the import convention must be used: import pandas as pd

In [1]:
import pandas as pd

Data Series - is a one-dimensional labeled array capable of holding any data type.

In [2]:
s = pd.Series([3,-5,7,4],index = ['a','b','c','d'])
s

a    3
b   -5
c    7
d    4
dtype: int64

Data Frames - two-dimensional labeled data structure with columns of different data types.

In [3]:
#Step 1 - create a dictionary
data = {'country':['belgium','india','brazil'],
       'capital':['brussels','new delhi','brasilia'],
       'population':[11190846,1303171035,207847528]}
#Step 2 - create a dataframe
df = pd.DataFrame(data,columns=['country','capital','population'])
df

   country    capital  population
0  belgium   brussels    11190846
1    india  new delhi  1303171035
2   brazil   brasilia   207847528

Python Demo 1: Creating a data series and dataframes using Panda

In [5]:
global_ps4_sales = pd.Series([10.0,30.2,35.9,73.6,91.6,94.7],index = [2014,2015,2016,2017,2018,2019])#if u want to define the rows, do this
global_ps4_sales

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [7]:
data = {'character': ['killua','kurapika','gon','chrollo','hisoka'],
       'nen':['kanmuru','jail chain','jajanken','bandit secret','bungee gum'],
       'nen type':['transmuter','conjurer','enhancer','specialist','transmuter'],
       'votes':[7488,7000,2472,1904,1144]}
hxh_popularity_poll = pd.DataFrame(data,columns = ['character','nen','nen type','votes'])
hxh_popularity_poll

  character            nen    nen type  votes
0    killua        kanmuru  transmuter   7488
1  kurapika     jail chain    conjurer   7000
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904
4    hisoka     bungee gum  transmuter   1144

In [8]:
hxh_popularity_poll.to_csv('mydataframe.csv')

In [10]:
aqd = pd.read_csv('aqd.csv')
aqd

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0             1   41.0    190.0   7.4    67      5    1
1             2   36.0    118.0   8.0    72      5    2
2             3   12.0    149.0  12.6    74      5    3
3             4   18.0    313.0  11.5    62      5    4
4             5    NaN      NaN  14.3    56      5    5
..          ...    ...      ...   ...   ...    ...  ...
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

[153 rows x 7 columns]

In [12]:
aqd.head()#if no value, it will output the first 5

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2
2           3   12.0    149.0  12.6    74      5    3
3           4   18.0    313.0  11.5    62      5    4
4           5    NaN      NaN  14.3    56      5    5

In [14]:
aqd.tail()#if no value, it will output the last 5

     Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
148         149   30.0    193.0   6.9    70      9   26
149         150    NaN    145.0  13.2    77      9   27
150         151   14.0    191.0  14.3    75      9   28
151         152   18.0    131.0   8.0    76      9   29
152         153   20.0    223.0  11.5    68      9   30

Python Demo 2: Subsetting, Slicing and Indexing of Data Structures

Subsetting -> certain element (1)

In [16]:
s = global_ps4_sales
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [17]:
df = hxh_popularity_poll
df

  character            nen    nen type  votes
0    killua        kanmuru  transmuter   7488
1  kurapika     jail chain    conjurer   7000
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904
4    hisoka     bungee gum  transmuter   1144

In [19]:
s[2016]

35.9

In [20]:
# iloc - m row, n column indexes
df.iloc[[3],[2]]

     nen type
3  specialist

In [21]:
# loc - m row index, column name
df.loc[[2], ['nen']]

        nen
2  jajanken

Slicing -> getting a portion

In [22]:
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [23]:
s[3:6]

2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [24]:
df

  character            nen    nen type  votes
0    killua        kanmuru  transmuter   7488
1  kurapika     jail chain    conjurer   7000
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904
4    hisoka     bungee gum  transmuter   1144

In [26]:
df[2:4]

  character            nen    nen type  votes
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904

In [27]:
df.loc[:,['nen type']]

     nen type
0  transmuter
1    conjurer
2    enhancer
3  specialist
4  transmuter

In [28]:
df.loc[[0,1],['character','votes']]

  character  votes
0    killua   7488
1  kurapika   7000

Indexing -> with given conditions

In [29]:
s

2014    10.0
2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [30]:
s[s>30]

2015    30.2
2016    35.9
2017    73.6
2018    91.6
2019    94.7
dtype: float64

In [31]:
df

  character            nen    nen type  votes
0    killua        kanmuru  transmuter   7488
1  kurapika     jail chain    conjurer   7000
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904
4    hisoka     bungee gum  transmuter   1144

In [32]:
df.loc[(df['votes']>1000)&(df['votes']<5000)]

  character            nen    nen type  votes
2       gon       jajanken    enhancer   2472
3   chrollo  bandit secret  specialist   1904
4    hisoka     bungee gum  transmuter   1144

In [33]:
df.loc[(df['nen type']=='transmuter')]

  character         nen    nen type  votes
0    killua     kanmuru  transmuter   7488
4    hisoka  bungee gum  transmuter   1144

In [34]:
df.loc[(df['nen']=='kanmuru'),['character']]

  character
0    killua

In [36]:
df.loc[(df['nen type']=='transmuter'), ['character', 'nen', 'votes']]

  character         nen  votes
0    killua     kanmuru   7488
4    hisoka  bungee gum   1144